Ultrawipf/OpenFFBoard/Firmware/Targets/ESP32SX/main/openffboard_esp32s2_v1.1_pins.h

#define OPENFFBOARD_NAME "OpenFFBoard ESP32S2 V1.1"

#define DIN7_Pin 255 // Define a invalid value 
#define DIN7_GPIO_Port GPIOE
#define DIN6_Pin 255 // Define a invalid value 
#define DIN6_GPIO_Port GPIOE
#define DIN5_Pin 255 // Define a invalid value 
#define DIN5_GPIO_Port GPIOE
#define DIN4_Pin 255 // Define a invalid value 
#define DIN4_GPIO_Port GPIOE
#define DIN3_Pin GPIO_PIN_8
#define DIN3_GPIO_Port GPIOE
#define DIN2_Pin GPIO_PIN_9
#define DIN2_GPIO_Port GPIOC
#define DIN1_Pin GPIO_PIN_10
#define DIN1_GPIO_Port GPIOC
#define DIN0_Pin GPIO_PIN_11
#define DIN0_GPIO_Port GPIOC

#define AIN2_Pin GPIO_PIN_3
#define AIN2_GPIO_Port GPIOC
#define AIN1_Pin GPIO_PIN_2
#define AIN1_GPIO_Port GPIOA
#define AIN0_Pin GPIO_PIN_1
#define AIN0_GPIO_Port GPIOA

#define SPI1_SCK_Pin GPIO_PIN_46
#define SPI1_MISO_Pin GPIO_PIN_38
#define SPI1_MOSI_Pin GPIO_PIN_39
#define SPI1_SS1_Pin GPIO_PIN_45
#define SPI1_SS1_GPIO_Port GPIOA
#define SPI1_SS2_Pin GPIO_PIN_33
#define SPI1_SS2_GPIO_Port GPIOB
#define SPI1_SS3_Pin GPIO_PIN_34
#define SPI1_SS3_GPIO_Port GPIOB

#define BUTTON_A_Pin GPIO_PIN_0
#define BUTTON_A_GPIO_Port GPIOB

#define DRV_ENABLE_Pin GPIO_PIN_13
#define DRV_ENABLE_GPIO_Port GPIOE
#define FLAG_Pin GPIO_PIN_14
#define FLAG_GPIO_Port GPIOE
#define DRV_GP1_Pin GPIO_PIN_12
#define DRV_GP1_GPIO_Port GPIOE
#define DRV_BRAKE_Pin GPIO_PIN_21
#define DRV_BRAKE_GPIO_Port GPIOE

#define PWM1_Pin GPIO_PIN_5
#define PWM1_GPIO_Port GPIOE
#define PWM2_Pin GPIO_PIN_7
#define PWM2_GPIO_Port GPIOE
#define PWM3_Pin GPIO_PIN_16
#define PWM3_GPIO_Port GPIOE
#define PWM4_Pin GPIO_PIN_17
#define PWM4_GPIO_Port GPIOE

#define ENCODER_Z_Pin GPIO_PIN_15
#define ENCODER_Z_GPIO_Port GPIOD
#define ENCODER_A_Pin GPIO_PIN_4
#define ENCODER_A_GPIO_Port GPIOC
#define ENCODER_B_Pin GPIO_PIN_6
#define ENCODER_B_GPIO_Port GPIOC

#define CAN_RX_Pin GPIO_PIN_35
#define CAN_TX_Pin GPIO_PIN_36
#define CAN_S_Pin GPIO_PIN_37

#define LED_SYS_Pin GPIO_PIN_42
#define LED_SYS_GPIO_Port GPIOD
#define LED_CLIP_Pin GPIO_PIN_41
#define LED_CLIP_GPIO_Port GPIOE
#define LED_ERR_Pin GPIO_PIN_40
#define LED_ERR_GPIO_Port GPIOE
